prod-deploy/results/prod-02-2-p1-baseline-20260722/round-1/randread-A2-r2/fio.txt
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=485706: Thu Jul 23 00:09:04 2026
  read: IOPS=3954, BW=989MiB/s (1037MB/s)(174GiB/180032msec)
    slat (usec): min=104, max=132948, avg=32359.68, stdev=22848.66
    clat (usec): min=2, max=6493.3k, avg=4063255.95, stdev=477246.37
     lat (usec): min=1748, max=6552.4k, avg=4095616.33, stdev=478257.64
    clat percentiles (msec):
     |  1.00th=[ 1754],  5.00th=[ 3574], 10.00th=[ 3708], 20.00th=[ 3842],
     | 30.00th=[ 3943], 40.00th=[ 4010], 50.00th=[ 4077], 60.00th=[ 4144],
     | 70.00th=[ 4245], 80.00th=[ 4329], 90.00th=[ 4463], 95.00th=[ 4597],
     | 99.00th=[ 5134], 99.50th=[ 5403], 99.90th=[ 5940], 99.95th=[ 6074],
     | 99.99th=[ 6275]
   bw (  KiB/s): min=506661, max=1509244, per=99.83%, avg=1010646.01, stdev=1147.04, samples=22558
   iops        : min= 1660, max= 7234, avg=3950.37, stdev= 6.07, samples=45080
  lat (usec)   : 4=0.01%, 10=0.02%, 20=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.02%, 100=0.02%
  lat (msec)   : 250=0.08%, 500=0.15%, 750=0.15%, 1000=0.14%, 2000=0.56%
  lat (msec)   : >=2000=98.86%
  cpu          : usr=0.02%, sys=0.08%, ctx=1447166, majf=7, minf=1050791
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=0.6%, >=64=98.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=711974,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=989MiB/s (1037MB/s), 989MiB/s-989MiB/s (1037MB/s-1037MB/s), io=174GiB (187GB), run=180032-180032msec